Parallel Programming/ParallelProgramming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ParallelProgramming</title>
<!-- 2018-01-14 Sun 19:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../css/style.css">
</head>
<body>
<div id="content">
<h1 class="title">ParallelProgramming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Day 1</a>
<ul>
<li><a href="#sec-1-1">1.1. Parallel Programming</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. <span class="todo TODO">TODO</span> Example of an Unparallelizable system</a></li>
<li><a href="#sec-1-1-2">1.1.2. Hardware</a></li>
<li><a href="#sec-1-1-3">1.1.3. OpenMP</a></li>
<li><a href="#sec-1-1-4">1.1.4. MPI</a></li>
<li><a href="#sec-1-1-5">1.1.5. Performance metrics</a></li>
<li><a href="#sec-1-1-6">1.1.6. Communication</a></li>
<li><a href="#sec-1-1-7">1.1.7. Important ideas</a></li>
<li><a href="#sec-1-1-8">1.1.8. CACHE COHERENCE</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. OpenMP</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Practical Problem: calculating Pi</a></li>
<li><a href="#sec-1-2-2">1.2.2. Managing variable access</a></li>
<li><a href="#sec-1-2-3">1.2.3. Thread scheduling</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Day 2</a>
<ul>
<li><a href="#sec-2-1">2.1. Distributed memory</a></li>
<li><a href="#sec-2-2">2.2. MPI</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Calculating pi with distributed memory</a></li>
<li><a href="#sec-2-2-2">2.2.2. 1-1 communication</a></li>
<li><a href="#sec-2-2-3">2.2.3. Collective COmmunication</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Task management</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Tips for Laplacian problem</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Day 1</h2>
<div class="outline-text-2" id="text-1">
<p>
Cindy is working on simulations! Quantum physics and lotsa cool stuff
Raison d'etre of parallel programming: Lots of data, hard simulations, lots of results
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Parallel Programming</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The use of <i>multiple processors</i> (CPUs, GPUS, devices, etc) for problem-solving.
</p>

<p>
Why is it useful? 
</p>
<ul class="org-ul">
<li>Each core can perform the same operations, so with many more cores, many more operations can be performed.
</li>
<li>Each core has its own memory
</li>
</ul>

<p>
However&#x2026;
</p>
<ul class="org-ul">
<li>Parallelizing code requires significant architectural changes
</li>
<li>It doesn't <i>magically</i> make serial code faster
</li>
<li>Communication between units introduces significant overhead
</li>
<li>Total time is determined by the slowest core. It becomes necessary to <i>synchronize</i> workers.
</li>
<li>Not all algorithms can be parallelized!
</li>
</ul>


<p>
One of the main problems to solve in parallel computation is managing <i>data transfer times</i>, i.e. the pipes between different cores. This introduces race conditions, locking, etc.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> <span class="todo TODO">TODO</span> Example of an Unparallelizable system</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
x1 = f(x1, x2, x3)
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Hardware</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
In a common computer, most memory is <code>DRAM</code>, which has high capacity but high latency (60-200 cycles). However, there's a CPU cache that allows quick access to frequently-used memory (2-10 cycles depending on cache level).
</p>

<p>
Even simple changes in array access can change memory access efficiency! By manipulating array access it is possible to exploit the L caches.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a>Levels<br  /><ol class="org-ol"><li><a id="sec-1-1-2-1-1" name="sec-1-1-2-1-1"></a>Core<br  /><div class="outline-text-6" id="text-1-1-2-1-1">
<p>
A single core has access to all three L levels, but is limited to performing serial/sequential operations.
</p>
</div>
</li>
<li><a id="sec-1-1-2-1-2" name="sec-1-1-2-1-2"></a>Chip/Socket<br  /><div class="outline-text-6" id="text-1-1-2-1-2">
<p>
With multiple cores, each core has its own individual L1 and L2 cache, but the L3 cache is typically shared between these cores to allow <i>shared memory access</i>. This is the first option for multiprocessing.
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-3" name="sec-1-1-2-1-3"></a>Motherboard<br  /><div class="outline-text-6" id="text-1-1-2-1-3">
<p>
Multiple chips in a single motherboard are connected through the DRAM memory exclusively and, in a different way than with individual cores, have Non-Uniform Memory Access (NUMA).
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-4" name="sec-1-1-2-1-4"></a>Computer Cluster<br  /><div class="outline-text-6" id="text-1-1-2-1-4">
<p>
Multiple motherboards in a rack are linked through <i>switches</i> to other racks, which may be organized in different ways depending on the chosen topology.
</p>
</div>
</li>

<li><a id="sec-1-1-2-1-5" name="sec-1-1-2-1-5"></a>Memory types<br  /><div class="outline-text-6" id="text-1-1-2-1-5">
<ul class="org-ul">
<li>Sequential processing (cores) &#x2013; L Caches
</li>
<li>Shared Memory (chips and motherboards)
</li>
<li>Distributed Memory
</li>
</ul>
</div>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> OpenMP</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Application Programming Interface &#x2013; Manages memory and task assignment for <i>shared memory</i>
</p>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> MPI</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Message Passing Interface &#x2013; Communication between nodes in a <i>distributed memory system</i>.
</p>
</div>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Performance metrics</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Speedup &#x2013; Performance gain in switching from serial to parallel: \(s_p=\frac{T_\text{serial}}{T_\text{parallel}}\)
Efficiency &#x2013; Speedup per core:
\(E_p=\frac{s_p}{p}\)
</p>

<p>
Allows us to gauge whether parallelizing is actually worth it. It's not always a worthwile investment, and this isn't even considering communication!
</p>
</div>
</div>

<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> Communication</h4>
<div class="outline-text-4" id="text-1-1-6">
<ul class="org-ul">
<li>Latency: Cost of sending 0B &#x2013; time related
</li>
<li>Bandwidth: Communication rate per second
</li>
</ul>

<p>
Granularity: Level of parallelization
</p>
</div>
</div>

<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> Important ideas</h4>
<div class="outline-text-4" id="text-1-1-7">
<p>
Parallelism depends on <i>processing</i> and <i>communication</i>
</p>
</div>
</div>

<div id="outline-container-sec-1-1-8" class="outline-4">
<h4 id="sec-1-1-8"><span class="section-number-4">1.1.8</span> CACHE COHERENCE</h4>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> OpenMP</h3>
<div class="outline-text-3" id="text-1-2">
<p>
API to write multithreaded programs. It:
</p>
<ul class="org-ul">
<li>Contains compilation directives and runtime libraries
</li>
<li>Facilitates implemntation in Fortran, C, and C++
</li>
<li>Support for multiple software and hardware architectures
</li>
<li>Comes by default in gcc and clang
</li>
</ul>

<p>
CHeck out the site at <a href="http://www.openmp.com/">OpenMP.com</a>
</p>
</div>


<ol class="org-ol"><li><a id="sec-1-2-0-1" name="sec-1-2-0-1"></a>Fork and Join model<br  /><div class="outline-text-5" id="text-1-2-0-1">
<p>
A single-threaded application stops to perform a parallel action, complete it, and return to a single thread.
</p>
</div>
</li>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Practical Problem: calculating Pi</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
&pi; can be estimated by calculating the integral \(\int_0^1 \frac{4}{1+x^2}dx\) with the desired approximation accuracy through the Riemann sum \(\sum_{i=0}^{n-1}f(x_1)\cdot\frac{1}{n}\)
</p>

<p>
The magical OpenMP directive: <code>#pragma omp parallel</code>
</p>
</div>
</div>



<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Managing variable access</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Private
</li>
<li>Shared
</li>
<li>FirstPrivate: Variable created on beginning of parallel block
</li>
<li>LastPrivate: Variable created at end of parallel block
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Thread scheduling</h4>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Day 2</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Distributed memory</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There's  no longer free access to memory located at different nodes &#x2013; data must be specifically requested.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> MPI</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Message Passing Interface for distributed memory systems&#x2013; It's a IEEE <i>standard</i>, not any particular piece of code.
</p>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Calculating pi with distributed memory</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
We must explicitly send and receive the data managed by each node using <code>MPI_SEND</code> and <code>MPI_RECV</code>.
</p>

<p>
Parallel code <i>must</i> be wrapped in <code>MPI_Init(&amp;argc, &amp;argv)</code> and <code>MPI_Finalize</code> 
</p>

<p>
Can define different rank sub-worlds
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 1-1 communication</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<code>MPI_SEND(&amp;total, num_vars=1, var_type=MPI_DOUBLE, to_rank=1, tag, MPI_COMM_WORLD)</code>
</p>

<p>
<code>MPI_RECV(&amp;sum, num_vars=1, var_type=MPI_DOUBLE, from_rank=0, tag, MPI_COMM_WORLD, status)</code>
</p>

<p>
Deadlocking
</p>
</div>
<ol class="org-ol"><li><a id="sec-2-2-2-1" name="sec-2-2-2-1"></a>Commands<br  /><ol class="org-ol"><li><a id="sec-2-2-2-1-1" name="sec-2-2-2-1-1"></a>MPI<sub>Send</sub><br  /></li>
<li><a id="sec-2-2-2-1-2" name="sec-2-2-2-1-2"></a>MPI<sub>Recv</sub><br  /></li>
<li><a id="sec-2-2-2-1-3" name="sec-2-2-2-1-3"></a>MPI<sub>Ssend</sub><br  /></li>
<li><a id="sec-2-2-2-1-4" name="sec-2-2-2-1-4"></a>MPI<sub>Bsend</sub><br  /></li>
<li><a id="sec-2-2-2-1-5" name="sec-2-2-2-1-5"></a>MPI<sub>Isend</sub><br  /></li>
<li><a id="sec-2-2-2-1-6" name="sec-2-2-2-1-6"></a>MPI<sub>Irecv</sub><br  /></li>
<li><a id="sec-2-2-2-1-7" name="sec-2-2-2-1-7"></a>MPI<sub>Ibsend</sub><br  /></li>
<li><a id="sec-2-2-2-1-8" name="sec-2-2-2-1-8"></a>MPI<sub>Issend</sub><br  /></li></ol>
</li></ol>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Collective COmmunication</h4>
<div class="outline-text-4" id="text-2-2-3">
</div><ol class="org-ol"><li><a id="sec-2-2-3-1" name="sec-2-2-3-1"></a>Commands<br  /><ol class="org-ol"><li><a id="sec-2-2-3-1-1" name="sec-2-2-3-1-1"></a>MPI<sub>Bcast</sub><br  /></li>
<li><a id="sec-2-2-3-1-2" name="sec-2-2-3-1-2"></a>MPI<sub>Reduce</sub><br  /></li>
<li><a id="sec-2-2-3-1-3" name="sec-2-2-3-1-3"></a>MPI<sub>Allreduce</sub><br  /></li>
<li><a id="sec-2-2-3-1-4" name="sec-2-2-3-1-4"></a>MPI<sub>Scatter</sub><br  /></li>
<li><a id="sec-2-2-3-1-5" name="sec-2-2-3-1-5"></a>MPI<sub>Gather</sub><br  /></li>
<li><a id="sec-2-2-3-1-6" name="sec-2-2-3-1-6"></a>MPI<sub>Allgather</sub><br  /></li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Task management</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Necessary when trying to combine MPI and OpenMP, as MPI automatically sees each core as a rank.
</p>

<p>
Tools like <code>SLURM</code> aid with setting this up, and utilities like <code>Jumpshot</code>, used in conjunction with <code>MPE</code>, allow us to visualize the flow of data within the cluster.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tips for Laplacian problem</h2>
<div class="outline-text-2" id="text-3">
<p>
Exploit isend and irecv
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-01-14 Sun 19:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
